[
 {
  "headlines":"Tata Group seeks regulatory approval to avoid listing NBFC, says report",
  "content":[
   "Indian conglomerate Tata Group has sought a formal waiver from the central bank to avoid listing Tata Sons, its holding company and non-banking finance firm, on stock exchanges, Bloomberg News reported on Friday, citing people familiar with the matter.",
   "In seeking the waiver, Tata Sons told the central bank it has used the proceeds from selling $1.1 billion worth of shares in Tata Consultancy Services last month to pay off loans to foreign and local lenders, the news agency reported. ",
   "Tata Sons' borrowings stood at $2.43 billion as of March 31, 2023. If it is able to lower its debt to below Rs 100 crore billion rupees, it could cease to be classified as an upper-layer NBFC by the RBI and avoid listing. ",
   "Tata Group and the RBI did not immediately reply to Reuters' requests for comment. ",
   "Tata Sons must be listed on or before September 2025 to adhere to an RBI regulation that large non-banking finance companies (NBFCs) list their shares within three years."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-03\/12\/full\/1710209480-8848.jpg"
 },
 {
  "headlines":"Housing financier Altum Credo raises $40 mn from Z3Partners, Oikocredit",
  "content":[
   "Affordable housing financier Altum Credo on Thursday announced a $40 million (around Rs 332 crore) fundraise in a round led by Z3Partners and impact investor Oikocredit.",
   "The 2017-founded company said the Series C round includes a $27 million fundraise in fresh equity and $13 million in partial exit to Series A investors, a statement said.",
   "The Pune-headquartered company plans to deploy the new capital for growing its assets under management, which stood at Rs 830 crore as of March 2024, it said.",
   "Apart from the lead investors, the UK's British International Investment and existing investors Aavishkaar Capital, Amicus Capital and PS Pai and family also participated in the new round, it said.",
   "It had raised a Series A equity funding of $9.8 million in 2018 and $12 million in Series B round in 2021.",
   "The company focuses on unserved and under-served segments using digital tools, targeting first time homeowners, and 93 per cent of the customers are from the economically weaker section (EWS) \/ low-income group (LIG) category.",
   "It had 11,000 customers in March 2024 and the gross non performing assets stood at 0.6 per cent.",
   "The average ticket size of its home loans is Rs 8.5 lakh with an average tenure of 15 years. With loan-to-value ratio below 50 per cent, the average value of the properties funded is around Rs 15-25 lakh.",
   "\"We believe the company is at an inflection point where physical and digital infrastructure come together to provide industry-leading operational metrics,\" Z3Partners' managing partner Rishi Maheshwari said.",
   "The funding will be used for enhancing its distribution network and expanding operational footprint, said the company, which has a presence in Maharashtra, Karnataka, Tamil Nadu, Andhra Pradesh, Telangana, and Rajasthan.",
   "Altum Credo's managing director and chief executive Vikrant Bhagwat termed the latest funding round a critical milestone for the next phase of sustainable growth.",
   "This will strengthen the balance sheet, enabling effective leverage and sound asset liability management."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/03\/full\/1712114417-8392.jpg"
 },
 {
  "headlines":"Need to preserve success on inflation control on durable basis: Das at MPC",
  "content":[
   "The success in controlling inflation has to be preserved and taken forward to achieve a 4 per cent inflation target on a durable basis, RBI Governor Shaktikanta Das stressed during the MPC meeting even as other members expressed concerns over the impact of geo-political developments on the price situation.",
   "The Reserve Bank on Friday released the minutes of the Monetary Policy Committee (MPC) meeting on Friday.",
   "It maintained status-quo on the benchmark lending rate (repo) at 6.5 per cent since February 2023 on concerns over inflation after the three-day MPC meeting held from April 3 to 5.",
   "Five of the six MPC members voted for the status quo in the policy rate.",
   "MPC member Jayanth R Varma, however, advocated a reduction in the repo rate by 25 basis points as \"high-interest rates entail a growth sacrifice\".",
   "According to the minutes, Das said the economic growth prospects of the Indian economy in 2024-25 look bright.",
   "He further said the baseline projections show inflation moderating to 4.5 per cent in 2024-25 from 5.4 per cent in 2023-24 and 6.7 per cent in 2022-23.",
   "\"This success in the disinflation process should not distract us from the vulnerability of the inflation trajectory to the frequent incidences of supply-side shocks, especially to food inflation due to adverse weather events and other factors,\" the governor said.",
   "He stressed that the gains in disinflation achieved over the last two years have to be preserved and taken forward, towards aligning the headline inflation to the 4 per cent target on a durable basis.",
   "\"The strong growth momentum, together with our GDP projections for 2024-25, give us the policy space to unwaveringly focus on price stability. Price stability is our mandated goal and it sets strong foundations for a period of high growth,\" Das said while voting for keeping the policy repo rate unchanged.",
   "He also said lingering geo-political tensions and their impact on commodity prices and supply chains are also adding to uncertainties in the inflation trajectory.",
   "Shashanka Bhide, Ashima Goyal, and Jayanth R Varma are external members, while RBI Governor Shaktikanta Das, Deputy Governor Michael Debabrata Patra, and Executive Director Rajiv Ranjan are from the central bank.",
   "Deputy Governor Patra said headline inflation can be expected to remain in the upper reaches of the tolerance band until favourable base effects come into play in the second quarter of 2024-25.",
   "\"Hence, conditions are not yet in place for any let up in the restrictive stance of monetary policy,\" he opined.",
   "Rajiv Ranjan said while monetary policy seems to be on the right track, it is too early to ease guard against inflation.",
   "MPC member Ashima Goyal said that global trade seems to be recovering but growth is mixed, and geopolitical risks continue.",
   "Inflation has come down substantially, but further progress is slow, she noted.",
   "Shashanka Bhide was of the opinion that food inflation trends would remain crucial to sustaining the movement of the headline inflation closer to the policy target of 4 per cent on a durable basis.",
   "The next meeting of the MPC is scheduled for June 5-7. "
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302183-6566.jpg"
 },
 {
  "headlines":"Andromeda expects 20% growth in loan disbursals, aims for Rs 1 trn in FY25",
  "content":[
   "Loan distributor Andromeda expects around 20 per cent growth in loan disbursals to around Rs 1 lakh crore during the current fiscal, driven primarily by mortgage demand.",
   "Loan disbursals have seen a 23 per cent growth to Rs 75,397 crore in FY'24, from Rs 60,000 crore in the previous fiscal, Andromeda Sales and Distribution Pvt Ltd Co-CEO Raoul Kapoor said.",
   "Despite the increase in housing prices, the demand for housing loans remains robust, he said, adding, the average ticket size of housing loans has witnessed an increase.",
   "In addition, he said, digitalization, faster approvals, and increased availability and flexibility have fueled higher demand for personal loans.",
   "The home loan business surged to approximately Rs 33,918 crore in FY24, up by over 22 per cent from Rs 27,798 crore in FY23.",
   "In FY24, he said, the loan against property distribution was at Rs 24,776 crore, an increase of 10.33 per cent from the preceding year's Rs 22,456 crore. ",
   "ALSO READ: Sundaram Home Finance eyes Rs 300 crore disbursements in Rajasthan",
   "Meanwhile, business loans experienced a notable surge of approximately 32 per cent, rising from Rs 5,255 crore in FY23 to Rs 6,927 crore in FY24, he said.",
   "Moreover, he said, there was a substantial increase observed in the personal loan and other loan segments as well.",
   "The company relies heavily on technology and recently launched an app called One Andro, he said.",
   "Besides, he said, there is a plan to further expand reach in Tier 2 and Tier 3 cities of the country.",
   "During the fiscal year ended March 2024, the company expanded its branch network to 470 branches from about 350 in the preceding year.",
   "Besides, Kapoor said, the company is planning to launch a wealth app through which mutual fund products would be distributed.",
   "Talks are on with various mutual fund houses for onboarding of their schemes, he said, adding the app is expected to be launched next month."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2023-10\/03\/full\/1696296617-2725.jpg"
 },
 {
  "headlines":"Sundaram Home Finance eyes Rs 300 crore disbursements in Rajasthan",
  "content":[
   "Sundaram Home Finance has strengthened its presence in Rajasthan under its plan to expand in select geographies as it eyes disbursements of Rs 300 crore over the next two to three years, a top official has said.",
   "The Chennai-based company offers home loans, plot loans, home improvement and extension loans and loans against property. It had recently strengthened its presence in Western parts of the country.",
   "A new branch was inaugurated in Kota, Rajasthan, and another branch is also planned in Udaipur in the coming months, the company said in a statement on Friday.",
   "Sundaram Finance has branches in Jaipur, Ajmer and Jodhpur in the Rajasthan market and believes that there is potential to register disbursements of around Rs 300 crore in the next two-three years. ",
   "ALSO READ: Manappuram Finance to raise up to $500 mn via external commercial borrowing",
   "\"Over the last couple of years, we have strengthened our presence in South India expanding into Tier II and III towns. While we continue to penetrate deeper into remote towns in this market, we are exploring opportunities to expand further in select geographies outside the South market,\" company Managing Director Lakshminarayanan Duraiswamy said.",
   "In February, the company had forayed into Navi Mumbai.",
   "\"The current expansion in Rajasthan combined with our plans to target the Western India market will go towards gradually expanding our footprint outside South India,\" he said in the statement.",
   "Sundaram Home Finance currently has over 140 branches in the Southern region and Madhya Pradesh, Rajasthan, Maharashtra and Gujarat."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/03\/full\/1712114417-8392.jpg"
 },
 {
  "headlines":"Manappuram Finance to raise up to $500 mn via external commercial borrowing",
  "content":[
   "Gold loan financier Manappuram Finance on Friday said its board has approved raising of up to $500 million (about Rs 4,100 crore) by way of external commercial borrowings (ECBs).",
   "The funds would be raised in one or more tranches, Manappuram Finance said in a regulatory filing.",
   "In the filing, the company said its financial resources and management committee of the board at its meeting held on April 19, 2024, has approved the fundraising proposal.",
   "Last month, the company approved fund raise by issuance of redeemable non-convertible debentures (NCDs) up to the overall limit of Rs 6,000 crore by way of private placement or public issue in one or more tranches to meet business growth.",
   "This is the fundraise plan for the financial year 2024-25, the company had said. ",
   "ALSO READ: Making gold investment, setting up home bar: Top personal finance stories"
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/09\/full\/1712682145-853.jpg"
 },
 {
  "headlines":"As oil rises, rupee falls 6 paise to 83.58 against US dollar in early trade",
  "content":[
   "The rupee depreciated 6 paise to 83.58 against the US dollar in early trade on Friday, weighed down by a negative trend in domestic equities and elevated crude oil prices.",
   "Forex traders said the strength of the American currency in the overseas market also dented investor sentiments.",
   "At the interbank foreign exchange, the rupee opened at 83.58 against the dollar, registering a fall of 6 paise over its previous close.",
   "The local unit pared the initial losses and also touched a high of 83.46 against the American currency in early trade on Friday.",
   "On Thursday, the rupee rebounded from its all-time low level and closed 9 paise higher at 83.52 against the US dollarMeanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was at 106.17, higher by 0.02 per cent.",
   "Brent crude futures, the global oil benchmark, rose 2.46 per cent to USD 89.25 per barrel.",
   "\"Brent Oil prices moved up to USD 90.48 per barrel after Iran threatened to review its stance on nuclear weapons if Israel attacked Tehran's nuclear sites,\" said Anil Kumar Bhansali, Head of Treasury and Executive Director Finrex Treasury Advisors LLP.",
   "Asian currencies were a tad lower on news of the conflict rising further as IDR fell to 16281, while the won fell to 1390. CNH also was lower at 7.2569. The yen was higher at 153.68 on account of risk aversion.",
   "\"Risk-off sentiments will keep the rupee on the weaker side,\" Bhansali said.",
   "On the domestic equity market, the 30-share BSE Sensex was trading 489.77 points, or 0.68 per cent lower at 71,999.22 points. The broader NSE Nifty was down 144.35 points, or 0.66 per cent, to 21,851.50 points.",
   "Foreign Institutional Investors (FIIs) were net sellers in the capital markets on Thursday as they offloaded shares worth Rs 4,260.33 crore, according to exchange data."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/17\/full\/1713292920-5238.jpg"
 },
 {
  "headlines":"Rupee appreciates 12 paise to 83.49 against US dollar in early trade",
  "content":[
   "The rupee rebounded from its all-time low levels and appreciated 12 paise to 83.49 against the US dollar in early trade on Thursday, supported by a firm trend in domestic equities and tracking gains in Asian currencies.",
   "Forex traders said the local unit gained ground as the American currency retreated from its elevated levels.",
   "At the interbank foreign exchange market, the local unit opened at 83.51 against the greenback. It later touched 83.49 in initial trade, registering a rise of 12 paise from its previous close.",
   "On Tuesday, the rupee plunged 17 paise to hit its lowest level of 83.61 against the US dollar for the second time in four weeks.",
   "Forex and money markets were closed on Wednesday on account of 'Ram Navami'.",
   "The Indian rupee which closed at record lows on Tuesday opened around 83.51 this morning as Asian currencies gained a bit against the dollar, said Anil Kumar Bhansali, Head of Treasury and Executive Director, Finrex Treasury Advisors LLP.",
   "The rupee is likely to trade in the range of 83.45 to 83.65 as FPIs and oil companies buy dollars while RBI sells the American currency as it did on Tuesday when it might have intervened by $2 billion, Bhansali added.",
   "Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was trading at 105.88, lower by 0.07 per cent.",
   "The dollar took a breather as traders assessed US interest rates outlook in the wake of comments from Federal Reserve officials that cemented expectations of monetary settings being restrictive for longer, Bhansali added.",
   "Brent crude futures, the global oil benchmark, rose 0.33 per cent to $87.58 per barrel.",
   "On the domestic equity market front, the 30-share BSE Sensex climbed 226.69 points or 0.31 per cent to 73,170.37 in early trade. The NSE Nifty advanced 89.05 points or 0.4 per cent to 22,236.95.",
   "Foreign Institutional Investors (FIIs) were net sellers in the capital markets on Tuesday as they offloaded shares worth Rs 4,468.09 crore, according to exchange data."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/03\/full\/1712114417-8392.jpg"
 },
 {
  "headlines":"RBI mandates offline payment aggregators to verify KYC for merchants",
  "content":[
   "The Reserve Bank of India’s (RBI) draft regulation for payment aggregators (PAs) will enable the latter to manage risks on their platform with well-defined Know Your Customer (KYC) norms for merchants, said market participants. ",
   "In the draft guidelines published Tuesday, the banking regulator outlined KYC procedures for small and medium-sized merchants. It said, a PA will need to undertake Contact Point Verification (CPV) and duly verify the bank account in which the funds of small merchants are settled. ",
   "Physical merchants that are undertaking only proximity or face-to-face transactions with business turnover less than the threshold limit of Rs 5 lakh per annum and those not registered under Goods and Services Tax (GST) are defined as ‘small merchants’ as per the draft norms.",
   "RBI has added that for ‘medium merchants’, PAs shall carry out the CPV. PAs shall also obtain and verify one Officially Valid Document (OVD) of the proprietor, beneficial owner or person holding attorney. They will be required to verify one OVD of the business.",
   "It has defined medium merchants as those with business turnover less than the threshold limit of Rs 40 lakh per annum and those not registered under GST. ",
   "ALSO READ: GST scores big for sports goods makers in West UP; pharma feels the pain",
   "“We welcome these guidelines from the Payments Council of India (PCI) perspective. It gives a much-needed clarity in terms of handling all different kinds of merchants and on what specific KYC of merchants that needs to be done,” said Vishwas Patel, joint managing director, Infibeam Avenues and chairman, PCI. ",
   "Players have added that following crackdown on companies such as Paytm Payments Bank for alleged KYC violations, the regulator may be placing norms in place to eliminate existing risk in the market. ",
   "“If (KYC) was a problem with Paytm, others would also be following suit. There are the usual risks associated such as money laundering that may be required to be curbed which is why the draft norms are in place,” an executive of a payments fintech said on condition of anonymity. ",
   "The player added that the draft norms will bring in consolidation within the sector.",
   "“Companies whose PA-PG (Payment Aggregator, Payment Gateway) applications have been returned, the chances of them getting them are low. It may lead to consolidation when these get out of the market,” the person said. ",
   "Such companies may look at acquiring other regulated firms or partnerships with them to continue their business, the executive added. ",
   "Single escrow account",
   "The recent draft norms aimed at regulating non-bank physical point-of-sale payment aggregators (PA-P) will streamline collection and settlement for merchants. ",
   "Previously, only the online point-of-sale payment aggregators (PA-O) were regulated by the RBI. Those servicing offline merchants, for in-store transactions, were not under the regulator’s purview. ",
   "“What was happening is that the lines between online and offline were blurring,” Patel of PCI said. He explained that earlier the challenge for PAs was that the funds coming for online merchants would go into one escrow account, and funds coming for offline merchants would go into another escrow account, and so on.  ",
   "“With the draft guidelines, it makes things easier, whether it is online or offline. It unifies everything and all will follow the same standards and rules. All single settlements are now possible through a single escrow account,” he added. ",
   "Essentially, the draft norms now allow escrow accounts opened by PAs to be utilised for both PA-O and PA-P activities. Funds with respect to the Delivery versus Payment (DvP) transactions, which were previously not covered under the RBI’s radar, can now be routed through escrow accounts. ",
   "Minimum net worth requirements",
   "The regulator has proposed net worth norms for payment aggregators (PAs) which facilitate face-to-face or proximity payment transactions. ",
   "Those entities which are providing services now need to have a minimum net worth of Rs 15 crore while applying to RBI for authorisation. They should have a minimum net worth of Rs 28 crore by March 2028, according to draft norms.",
   "New non-bank PA-Ps will be required to have a minimum net worth of Rs 15 crore at the time of application to the RBI for authorisation. They will be required to attain a minimum net worth of Rs 25 crore by the end of the third financial year of grant of authorisation and maintained at all times thereafter. New draft norms ",
   "PAs to conduct KYC due diligence of small, medium merchants  ",
   "Ensure merchant transactions in line with their business profile ",
   "Have risk-based payment limits for merchants ",
   "Due diligence aimed at eliminating risk in the market"
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/17\/full\/1713376676-1931.jpg"
 },
 {
  "headlines":"RupeeQ aims Rs 300 cr loan disbursement portfolio on rural expansion",
  "content":[
   "Home-grown platform for online loans and credit cards RupeeQ aims to treble digital loan disbursements portfolio to Rs 300 crore by 2027 on the back of government's push towards high-speed internet services in semi-urban and rural areas.",
   "Talking to PTI, Neeru Puri, Managing Director and Chief Financial Officer of RupeeQ, said, \"It is estimated that total value of digital lending business in India will exceed $1 trillion over next 5 years. At RupeeQ, we expect to treble our loan disbursement portfolio by 2027, while in fiscal 2023-24 we clocked about Rs 100 crore.\"According to reports, India shall have 900 million active internet users by 2025, while 56 per cent of all new internet users will be from rural areas, and 65 per cent of new internet users will be female.",
   "Puri opined that the government's push on digitalisation and penetration of high-speed internet even in semi-urban and rural areas will help the company materialise its goal.",
   "Puri said the digital lending space in India saw a phenomenal growth in value from $270 billion in 2022 to an estimated worth of $350 billion by end of next year with a remarkable compound annual growth rate (CAGR) of 39.5 per cent.",
   "In the current financial year, the digital footprint of financial services consumers would increase to 75 per cent (from current 50 per cent). This is primarily due to the explosion of smartphones as well as mobile internet, Puri explained.",
   "As per a recent Boston Consulting Group's (BCG) report, loan disbursement models in the last few years have seen frenetic activity.",
   "There are a few fundamental drivers which are all coming together to turbo-charge this space.",
   "First, consumer behaviours are changing dramatically, shaped by experiences offered by internet giants. Second, there have been some rapid technological advances, led by the ever increasing penetration of smartphones as well as the proliferation of data. Third, the regulatory environment is increasingly getting favourable with laws increasingly providing an impetus to the digital lending market.",
   "Puri cited the fact that 890 million Aadhaar card holders are from rural India and said that in the coming years, \"we shall witness a sharp rise in loan enquiries from rural areas as the digitisation will make it very simple for the rural population to get loans using e-KYC (electronic know-your-customer)."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/01\/full\/1711938680-865.jpg"
 },
 {
  "headlines":"Amazon Pay explores credit on UPI through collaboration with NPCI",
  "content":[
   "Amazon Pay is looking to introduce credit services on the Unified Payments Interface (UPI) platform in collaboration with the National Payments Corporation of India (NPCI). This initiative aims to enhance customer experience and value propositions, Vikas Bansal, Amazon Pay India's whole-time director, told The Financial Express (FE).",
   "This news follows Amazon Pay's recent partnerships with RBL Bank for UPI payments, ICICI Bank for FASTag recharge, and the introduction of the Amazon Pay ICICI co-branded credit card.",
   "The platform obtained a payment aggregator license from the Reserve Bank of India (RBI) in February of this year, expanding its financial services portfolio. Earlier, it had received the central bank's approval for a prepaid payment instrument licence.",
   "With over 100 million customers utilising Amazon Pay UPI for various transactions such as shopping, bill payments, and online merchant transactions, the platform is already widely adopted. Amazon also already offers instant credit through its Amazon Pay Later option, allowing customers to make purchases on its marketplace through equated monthly installments.",
   "Amazon Pay boasts partnerships with approximately 8.5 million brick-and-mortar sellers across 350 urban and rural areas, along with over 10,000 online sellers.",
   "The platform has also collaborated with financial entities like Axio, IDFC FIRST Bank, and Karur Vysya Bank to offer 'Buy Now Pay Later' services, amassing nine million customer sign-ups with a payment success rate of 99.9 per cent.",
   "Additionally, NPCI has recently unveiled three new features for UPI-linked RuPay credit cards, including EMI facilities, UPI AutoPay for credit card bill settlements, and enhanced credit limits, promising further advancements in digital payments, set to roll out from May 31."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2021-03\/29\/full\/1616959124-7.jpg"
 },
 {
  "headlines":"Top financial regulators plan panel to weigh risks in derivatives market",
  "content":[
   "India's top financial regulators will form a committee to assess stability risks emerging from a surge in derivatives markets and suggest policy changes if required, two sources familiar with the matter said. ",
   "Options trading in India has soared in the last five years, fuelled mainly by retail investors. The notional value of index options traded more than doubled in 2023-24 to $907.09 trillion from $447.69 trillion a year ago, exchange operator NSE says. ",
   "The panel will be set up by the Financial Stability Development Council, which includes the finance minister, the central bank governor and the market regulator, the sources said. ",
   "Its members and reporting timeline will be finalised in coming months, added the sources, who spoke on condition of anonymity, as they were not authorised to speak to media. ",
   "The plan to set up a panel has not been previously reported. ",
   "India's finance ministry, the central bank, the Reserve Bank of India and the regulator, the Securities and Exchange Board of India, did not immediately respond to queries about the plan. ",
   "The committee will assess potential systemic risks emerging from the surge in derivatives trading, the need for investor protection measures and for increased regulatory monitoring, the two sources said. ",
   "It will also check for a correlation between the rise in small unsecured loans and options trading, said one of the two sources.",
   "\"Checks would be made on end-use of funds lent by non-banking finance companies which have a broking arm and whether those funds led to capital market exposure,\" the source added. ",
   "Personal loans, whose end use is not monitored by banks, have been growing at a rapid clip of more than 20 per cent a year, central bank data shows. ",
   "The ratio of the notional value of derivatives traded in India to more traditional cash trading is 422 times, the world's highest, Axis Mutual Fund said in an October 2023 report. ",
   "In most markets, derivatives volumes now account for 5 to 15 times cash market volumes, it added. ",
   "\"Even in terms of premium turnover to cash ratio, India is an outlier and is higher than most other global economies,\" said Ashish Gupta, the fund's chief investment officer. ",
   "Premium turnover is the market value of a contract or the price at which the contract is bought or sold and is typically lower than notional volume, the total value of the contract.",
   "(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)"
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/12\/full\/1712889044-8194.jpg"
 },
 {
  "headlines":"Rupee depreciates 9 paise to 83.53 against US dollar in early trade",
  "content":[
   "The rupee depreciated 9 paise to 83.53 against the US dollar in early trade on Tuesday, weighed down by a strong American currency and elevated crude oil prices.",
   "Forex traders said a negative trend in domestic equities and sustained foreign fund outflows also dented investor sentiments.",
   "According to interbank foreign exchange, the rupee opened at 83.51 against the dollar and touched a low of 83.53 in the initial trade, registering a fall of 9 paise over its previous close.",
   "On Monday, the rupee declined 6 paise to settle at 83.44 against the US dollar.",
   "Rupee fell further as foreign portfolio investors continued to buy dollars and sell stocks on risk aversion due to Middle East tensions and US yields heading higher, said Anil Kumar Bhansali, Head of Treasury and Executive Director, Finrex Treasury Advisors LLP.",
   "\"Need to watch what the Reserve Bank of India (RBI) does to counter the rupee depreciation,\" Bhansali added.",
   "Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was at 106.34, higher by 0.13 per cent.",
   "Brent crude futures, the global oil benchmark, rose 0.53 per cent to $90.58 per barrel, as Israel weighed response to the Iran attack amidst heightened tensions in the Middle East.",
   "On the domestic equity market, the 30-share BSE Sensex was trading 307.44 points, or 0.42 per cent lower at 73,092.34 points. The broader NSE Nifty was down 76.50 points, or 0.34 per cent, to 22,196.00 points.",
   "Foreign Institutional Investors (FIIs) were net sellers in the capital markets on Monday as they offloaded shares worth Rs 3,268.00 crore, according to exchange data.",
   "On the macroeconomic front, wholesale inflation in the country rose marginally to a three-month high of 0.53 per cent in March compared to 0.20 per cent in the preceding month due to an increase in prices of vegetables, potato, onion, and crude oil.",
   "Moreover, India's merchandise exports dipped marginally in March to $41.69 billion, and by 3.11 per cent during the last fiscal year to $437.06 billion mainly due to continued geopolitical turmoil, and depressed global trade."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/03\/full\/1712114417-8392.jpg"
 },
 {
  "headlines":"Chatroom: Customs should not hold up exports due to valuation issues",
  "content":[
   "We are an EOU. We cleared the goods manufactured by us into DTA after reversing the BCD and SWS. Now, the DTA party has rejected the goods. How can we square the transactions and get back the BCD and SWS paid to the government? Under what documents should the DTA party return the goods? ",
   "Firstly, you can give a credit note to the DTA party and square the transaction. Next, the DTA party can send back the rejected goods under a delivery challan. Third, you can receive the goods and treat the inputs on the goods as duty paid, so that when you reprocess or repair the rejected goods and supply again to the same or another party in DTA, you need not pay any BCD or SWS. Of course, if you export the repaired or reprocessed goods, you can claim drawback of the BCD and SWS paid on the inputs through brand rate. ",
   "We got our advance authorisation invalidated for direct imports and got an invalidation letter issued in favour of the intermediate supplier. For some reason, that supplier has defaulted and we have not received the goods from him. We don’t know whether an advance authorisation for intermediate supplies against the invalidation letter was issued and if so, whether it was utilised and if so, to what extent. Now, is there any provision whereby we can get the credit back in the advance authorisation so that we can use that amount to make direct imports? ",
   "I don’t find any provision for such an eventuality. I suggest you approach the policy relaxation committee at the DGFT HQ. You can plead that even if an advance authorisation has been issued against the invalidation letter and it has been utilised, the failure to supply you the intermediates can result in recovery of the duty on the inputs imported by the intermediate supplier and so, giving the re-credit in your advance authorisation need not result in any loss for the government. You may also offer to give any affidavit regarding non-receipt of intermediates from the supplier and indemnity the government against any losses.   Of course, your advance authorisation should be valid for re-credit. ",
   "We do not have an IEC. We want to export samples to a foreign party who is interested in our goods. If he approves the samples, he will place the order. We know that to export or import, we need an IEC. Do we need an IEC even for sending samples? ",
   "Para 2.07 of HBP gives the list of categories exempted from IEC number. Export of samples is not covered there. ",
   "The Customs have held up our export consignment because our export price is nearly twice the price our purchase price. How to convince the Customs to allow export of the goods and investigate later? ",
   "You can refer the Customs to CBEC Circular no.37\/2007-Cus dated 9th October 2007. It says that export consignments should not be held up for valuation enquiries\/investigations.",
   "Business Standard invites readers’ SME queries related to GST, export and import matters. You can write to us at smechat@bsmail.in"
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-01\/16\/full\/1705411133-6757.jpg"
 },
 {
  "headlines":"Banks can't charge additional than key facts statement, says RBI",
  "content":[
   "Banks and other regulated entities cannot charge additional fees throughout the loan term which are not mentioned in the Key Fact Statement without the consent of the borrower, the Reserve Bank of India said in a notification on Monday.",
   "The notification said that all new retail and MSME term loans sanctioned on or after October 1, including fresh loans to existing customers, must adhere to the KFS guidelines without exception.",
   "“Any fees, charges, etc. which are not mentioned in the KFS, cannot be charged by the REs to the borrower at any stage during the term of the loan, without explicit consent of the borrower,” the regulator said.",
   "“REs shall put in place the necessary systems and processes to implement the above guidelines at the earliest. In any case, all new retail and MSME term loans sanctioned on or after October 1, 2024, including fresh loans to existing customers, shall comply with the above guidelines in letter and spirit without any exception,” the notification further said.",
   "Among others, the KFS will include Annual Percentage Rate (APR), which is the annual cost of credit to the borrower that includes the interest rate and all other charges associated with the credit facility.",
   "The central bank had mandated during February's Monetary Policy that all regulated entities must provide a Key Fact Statement (KFS) to retail and MSME borrowers, comprising crucial information including the all-inclusive annual percentage rate (APR) and details on recovery and grievance redress mechanisms.",
   "KFS is a statement of key facts of a loan agreement, in simple and easier-to-understand language, provided to the borrower in a standardised format.",
   "The RBI specified in the notification that the KFS should be written in a language comprehensible to the borrowers.",
   "Additionally, it must include a unique proposal number and remain valid for at least three working days for loans with a tenor of seven days or more, and one working day for loans with a tenor of less than seven days.",
   "Regulated entities must procure an acknowledgment from the borrower confirming their comprehension, said the RBI. The KFS must incorporate a computation sheet detailing the APR and the loan's amortisation schedule throughout its duration. This APR must include all charges imposed by the entity, along with any charges recuperated from borrowers on behalf of third-party service providers, which must be fully disclosed."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/04\/full\/1712170537-0185.jpg"
 },
 {
  "headlines":"India bond yields steady; focus on oil prices amid West Asia tension",
  "content":[
   "Indian government bond yields were little changed on Monday following a decline in oil prices, with the market downplaying the risk of broader regional conflagration after Iran's weekend attack on Israel.",
   "The broader market sentiment was supported by a fall in local inflation data, traders said. ",
   "The yield on the benchmark Indian 10-year note ended at 7.1779%, after closing at 7.1794% in the previous session. ",
   "\"Oil prices stabilised after Iran said that the retaliation was over. So that gave comfort to the market and we did not see any sharp movement in local bond yields,\" said Yogesh Kalinge, vice president at A.K. Capital Services. ",
   "Oil prices slipped by about 1% on Monday, after rising on Friday in anticipation of Iran's retaliatory attack, with prices touching their highest since October. ",
   "Any further escalation of the conflict in the Middle East has the potential to amplify the commodity prices, especially crude oil, India Ratings and Research said in a note. ",
   "Higher commodity prices could impact domestic retail inflation. ",
   "India's annual retail inflation rate eased in March to a five-month low of 4.85%, helped by a drop in fuel prices but economists say a rate cut by the central bank is still some months away as food prices remain sticky. ",
   "Meanwhile, U.S. Treasury yields eased on Friday as the Middle East tensions spurred safe-haven buying. The U.S. yields were higher in Asian trade on Monday and were last at 4.57%. ",
   "Market participants have readjusted their rate-cut expectations from the Federal Reserve after an elevated U.S.",
   "inflation reading last week. ",
   "Market bets on the U.S. central bank cutting its target rate in June fell to 27.1%, down from 53.2% a week earlier, according to the CME Group's FedWatch Tool. ",
   "Two Indian states will raise 19 billion rupees ($227.74 million) through the sale of bonds."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-03\/04\/full\/1709573886-6448.jpg"
 },
 {
  "headlines":"Rupee depreciates 6 paise to 83.44 against US dollar in early trade",
  "content":[
   "The rupee declined 6 paise to 83.44 against the US dollar in early trade on Monday, tracking negative equity markets and withdrawal of foreign funds amid renewed concerns over geopolitical tensions in the Middle East.",
   "Forex traders said a strong American currency in the overseas market and curde oil prices hovering above $90 per barrel also dented investor sentiments.",
   "At the interbank foreign exchange, the rupee opened at 83.46 against the dollar and gained slightly to 83.44 in the initial trade, registering a fall of 6 paise over its previous close.",
   "On Friday, the rupee closed 7 paise lower at 83.38 against the US dollar.",
   "Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was trading 0.08 per cent lower at 105.75.",
   "The higher dollar index was attributed to diminishing expectations of an immediate rate cut by the US Federal Reserve.",
   "Brent crude futures, the global oil benchmark, declined 0.31 per cent to $90.17 per barrel.",
   "On the domestic equity market, the 30-share BSE Sensex was trading 569.05 points, or 0.77 per cent lower at 73,675.85 points. The broader NSE Nifty was down 178.95 points, or 0.79 per cent, to 22,340.45 points.",
   "Foreign Institutional Investors (FIIs) were net sellers in the capital markets on Friday as they sold shares worth Rs 8,027 crore, according to exchange data.",
   "India's forex reserves jumped by $2.98 billion to a fresh peak of $648.562 billion for the week ended April 5, the RBI said on Friday."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/01\/full\/1711938680-865.jpg"
 },
 {
  "headlines":"BoB World app scam cases: FinMin pushes for enhanced KYC procedure",
  "content":[
   "In a bid to check incidence of BoB World app scam and other such financial frauds, the finance ministry makes a case for an enhanced KYC procedure and extensive due diligence by banks and financial institutions for onboarding merchants to safeguard customers against cyber risks, sources said.",
   "Appropriate due diligence of merchants and Business Correspondents (BCs) who offer banking services in rural and remote areas is necessary not only to check frauds but also to fortify the financial ecosystem, sources said.",
   "According to sources, there is a need to strengthen data security and data protection at the level of merchants and BCs as chances of compromise are higher at that level.",
   "Therefore, sources said, RBI may advice banks and financial institutions to review the concentration of BCs in cyber fraud hotspots and their onboarding, blocking of micro ATMs found to be involved in frauds.",
   "This was one of the suggestions made at an inter-ministerial meeting held recently with the objective of furthering cyber security and checking financial fraud, sources said.",
   "During 2023, as many as 11,28,265 cases of financial cyber fraud worth Rs 7,488.63 crore were reported, as per the data compiled by National Crime Records Bureau (NCRB).",
   "To strengthen the mechanism to deal with cyber crimes in a comprehensive and coordinated manner, the central government, through the Ministry of Home Affairs, has set up the 'Indian Cyber Crime Coordination Centre' (I4C) to deal with all types of cyber crime in the country.",
   "As part of its efforts to curb growing cyber fraud, the Reserve Bank is considering setting up a Digital India Trust Agency (DIGITA) to stop the mushrooming of illegal lending apps.",
   "The proposed agency will enable verification of digital lending apps and maintain a public register of verified apps, sources said.",
   "Meanwhile, the Reserve Bank of India has shared a list of 442 unique digital lending apps with the IT Ministry to whitelist with Google.",
   "Besides, Google has removed over 2,200 digital lending apps (DLAs) from its app store from September 2022 to August 2023.",
   "The search giant has updated its policy regarding the enforcement of loan apps on the Play Store, and allowed only those apps which are published by the RBI's regulated entities (REs) or those working in partnership with REs.",
   "This policy change by Google has happened at the request of the Reserve Bank of India (RBI) and the Department of Financial Services (DFS) under the finance ministry."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712299816-1565.jpg"
 },
 {
  "headlines":"Amended India-Mauritius tax treaty protocol yet to be notified: I-T dept",
  "content":[
   "The Income Tax Department on Friday said the amended India-Mauritius protocol on double taxation avoidance agreement is yet to be ratified and notified by the department.",
   "India and Mauritius on March 7, 2024, signed an amendment to the DTAA and included a principal purpose test (PPT) in the pact which aims to curtail tax avoidance by ensuring that treaty benefits are only granted for transactions with a bona fide purpose.",
   "There were concerns that foreign portfolio investments coming via Mauritius would face increased scrutiny by tax authorities. Also, there were apprehensions that past investments could be covered by the amended protocol.",
   "In a post on X (formerly Twitter), the I-T department said some concerns have been raised on the India Mauritius DTAA amended recently.",
   "\"In this context, it is clarified that the concerns \/queries are premature at the moment since the Protocol is yet to be ratified and notified u\/s 90 of the Income-tax Act, 1961.",
   "\"As and when the Protocol comes into force, queries, if any, will be addressed, wherever necessary,\" the I-T department said.",
   "Historically, Mauritius has been a preferred jurisdiction for engaging in investments in India due to the non-taxability of capital gains from the sale of shares in Indian companies until 2016.",
   "In 2016, India and Mauritius signed a revised tax agreement, which gave India the right to tax capital gains in India on transactions in shares routed through the island nation beginning April 1, 2017. However, investments made before April 2017 were grandfathered.",
   "IndusLaw Partner Lokesh Shah said with PPT test now introduced in the India-Mauritius tax treaty, tax authorities in India are likely to look beyond TRC (tax residency certificate by Mauritius tax authorities) and will have the ability to deny the benefit of India-Mauritius tax treaty if it is reasonable to conclude, having regard to all relevant facts and circumstances, that obtaining the treaty benefits was one of the principal purposes of any arrangement or transaction that resulted directly or indirectly such tax benefit.",
   "\"The tax authorities will have the ability to take a closer look at the structure and assess the intent and commercial rationale, before granting treaty benefits. Existing structures \/ investments from Mauritius will now need to pass through the PPT test,\" Shah said.",
   "India's benchmark equity indices Sensex and Nifty plunged by 1 per cent on Friday due to across-the-board profit taking by investors. The 30-share BSE Sensex tanked 793.25 points or 1.06 per cent to settle at 74,244.90 with 27 of its components ending in the red. During the day, it dropped 848.84 points or 1.13 per cent to 74,189.31."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-02\/01\/full\/1706807566-6713.jpg"
 },
 {
  "headlines":"RBI rejects two more applications for setting up small finance banks",
  "content":[
   "The Reserve Bank of India (RBI) has rejected two more applications for setting up small finance banks: Dvara Kshetriya Gramin Financial Services Private Limited and Tally Solutions Private Limited.",
   "So far, the regulator has received 13 applications to set up banks under the guidelines for 'on tap' licensing of Universal Banks and Small Finance Banks, RBI said in a release on Friday.",
   "In January this year, Fino Payments Bank applied to the RBI for a small finance bank licence. Bhubaneswar-based micro-lending Annapurna Finance Private Limited applied for a universal bank licence in January last year. Both applications are still under consideration. ",
   "Bank Licence: Status Check",
   "So far, the RBI has received 13 applications to set up banks under the Guidelines for 'On Tap' Licensing of Universal Banks and Small Finance Banks. Eleven applications have been rejected, while two are still under consideration.",
   "Applicants under Guidelines for ‘On Tap’ Licensing of Universal Banks",
   "UAE Exchange and Financial Services Limited [Rejected]",
   "The Repatriates Cooperative Finance and Development Bank Limited (REPCO Bank) [Rejected]",
   "Chaitanya India Fin Credit Private Limited [Rejected]",
   "Shri Pankaj Vaish and others [Rejected]",
   "Annapurna Finance Private Limited, Bhubaneswar [Under consideration]",
   "Applicants under Guidelines for ‘On Tap’ Licensing of Universal Banks",
   "VSoft Technologies Private Limited [Rejected]",
   "Calicut City Service Co-operative Bank Limited [Rejected]",
   "Shri Akhil Kumar Gupta [Rejected]",
   "Dvara Kshetriya Gramin Financial Services Private Limited [Rejected]",
   "Cosmea Financial Holdings Private Limited [Rejected]",
   "Tally Solutions Private Limited [Rejected]",
   "West End Housing Finance Limited [Rejected]",
   "Fino Payments Bank Limited [Under consideration]"
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302989-534.jpg"
 },
 {
  "headlines":"RBI rejects two applications for small finance bank under extant guidelines",
  "content":[
   "The Reserve Bank of India has rejected two more applications, including that of Dvara Kshetriya Gramin Financial Services, for setting up small finance banks.",
   "Earlier in July 2023, it had rejected three applications.",
   "RBI had received about a dozen applications to set up banks under the guidelines for 'on tap' Licensing of Universal Banks and Small Finance Banks (SFBs).",
   "The guidelines for 'on tap' licensing of Universal Banks and SFBs in the private sector were issued on August 1, 2016, and December 5, 2019, respectively.",
   "In a statement on Friday, the RBI said the examination of two more applications for setting up a small finance bank has been completed as per the procedure laid down under extant guidelines. ",
   "ALSO READ: Forex reserves jump $2.98 billion to new peak of $648.562 billion: RBI",
   "Based on the assessment of the applications, the central bank said it did not find applicants -- Dvara Kshetriya Gramin Financial Services Private Limited and Tally Solutions Private Limited -- suitable for granting of in-principle approval to set up a small finance bank.",
   "However, two remaining applications are still \"under examination\".",
   "In May 2022, it announced the decisions on six applications.",
   "In July last year, the RBI had rejected applications of Akhil Kumar Gupta, Cosmea Financial Holdings Pvt Ltd and West End Housing Finance Ltd.",
   "As per the guidelines, the initial minimum paid-up voting equity capital for a universal bank should be Rs 500 crore. Thereafter, the bank should have a minimum net worth of Rs 500 crore at all times.",
   "The minimum paid-up voting capital\/net worth for SFBs should be Rs 200 crore.",
   "In case of urban co-operative banks desirous of voluntarily transiting into SFBs, the initial requirement of net worth is Rs 100 crore, which will have to be increased to Rs 200 crore within five years."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302989-534.jpg"
 },
 {
  "headlines":"Forex reserves jump $2.98 billion to new peak of $648.562 billion: RBI",
  "content":[
   "India's forex reserves jumped by $2.98 billion to a fresh peak of $648.562 billion for the week ended April 5, the RBI said on Friday.",
   "In the previous reporting week, the forex kitty had increased by $2.951 billion to $645.583 billion, which was an all-time high.",
   "In September 2021, the country's forex kitty reached an all-time high of $642.453 billion, a level that was breached in March this year.",
   "The reserves took a hit as the central bank deployed the kitty to defend the rupee amid pressures caused majorly by global events, but there has been a steady accretion over the past few months. ",
   "ALSO READ: Govt focus on infra to nurture sustained revival in investment: RBI report",
   "For the week ended April 5, the foreign currency assets, a major component of the reserves, increased by $549 million to $571.166 billion, the data released on Friday showed.",
   "Expressed in dollar terms, the foreign currency assets include the effect of appreciation or depreciation of non-US units like the euro, pound and yen held in the foreign exchange reserves.",
   "Gold reserves increased by $2.398 billion to $54.558 billion during the week, the RBI said.",
   "The Special Drawing Rights (SDRs) were up by $24 million to $18.17 billion, the apex bank said.",
   "India's reserve position with the IMF was also up by $9 million to $4.669 billion in the reporting week, the apex bank data showed."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/01\/full\/1711909900-1925.jpg"
 },
 {
  "headlines":"Rupee declines 7 paise to 83.38 against US dollar in early trade today",
  "content":[
   "The rupee depreciated 7 paise to 83.38 against the US dollar in early trade on Friday, weighed down by a negative trend in domestic equities and elevated crude oil prices.",
   "Forex traders said the strength of the American currency in the overseas market also dented investor sentiments.",
   "At the interbank foreign exchange, the rupee opened at 83.36 against the dollar and touched a low of 83.38 in the initial trade, registering a fall of 7 paise over its previous close.",
   "On Wednesday, the rupee closed flat at 83.31 against the US dollar.",
   "Stock, money, commodity, and derivative markets were closed on Thursday on account of Eid-Ul-Fitr.",
   "Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was at 105.35, higher by 0.07 per cent.",
   "Brent crude futures, the global oil benchmark, rose 0.58 per cent to USD 90.26 per barrel.",
   "\"Brent oil continued to remain in the higher side of the curve on Middle East jitters as Iran promised to retaliate for a suspected air strike on its embassy in Syria which could risk disruptions of shipments from the Region,\" said Anil Kumar Bhansali Head of Treasury and Executive Director Finrex Treasury Advisors LLP.",
   "Bhansali further noted that the rupee which fell to 83.40 in the Non-deliverable Forwards (NDF) market on Wednesday evening recovered to an opening of 83.32 on Friday morning. \"As RBI may protect it from depreciation beyond 83.40 exporters may sell at this level for all near term exports,\" he said.",
   "On the domestic equity market, the 30-share BSE Sensex was trading 374.49 points, or 0.50 per cent lower at 74,663.66 points. The broader NSE Nifty was down 123.90 points, or 0.54 per cent, to 22,629.90 points.",
   "Foreign Institutional Investors (FIIs) were net buyers in the capital markets on Wednesday as they purchased shares worth Rs 2,778.17 crore, according to exchange data."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/03\/full\/1712114417-8392.jpg"
 },
 {
  "headlines":"India's UPI transactions way more than US digital payments, says Jaishankar",
  "content":[
   "External Affairs Minister (EAM) S Jaishankar recently highlighted India's remarkable progress in digital payments, noting that the country now conducts transactions worth Rs 120 crore per month through the Unified Payments Interface (UPI). In contrast, he pointed out that in the United States, digital transactions amount to only Rs 40 crore per year.",
   "Speaking at an event in Rajasthan's Bikaner, Jaishankar emphasised, \"Today, we do cashless payments through UPI. We have transactions worth Rs 120 crore in a month. While the US makes digital transactions worth Rs 40 crore in a year. You should see how we have progressed in some areas and the world commends that.\"",
   "The UPI is a platform that consolidates various bank accounts into a unified mobile application. Launched on April 11, 2016, by the former governor of the Reserve Bank of India (RBI), Raghuram Rajan, this initiative integrates multiple banking functionalities, facilitating effortless fund transfers and convenient merchant transactions.",
   "In a recent proposal, the RBI announced its plan to allow users to deposit cash in cash deposit machines (CDMs) through the UPI. ",
   "Announcing the monetary policy outlook for the current fiscal year, RBI Governor Shaktikanta Das stated, \"Deposit of cash through cash deposit machines (CDMs) is primarily being done through the use of debit cards. Given the experience gained from cardless cash withdrawal using UPI at the ATMs, it is now proposed to facilitate deposit of cash in CDMs using UPI.\"",
   "He further added, \"At present, UPI payments from Prepaid Payment Instruments (PPIs) can be made only by using the web or mobile app provided by the PPI issuer. It is now proposed to permit the use of third-party UPI apps for making UPI payments from PPI wallets. This will further enhance customer convenience and boost adoption of digital payments for small value transactions.\"",
   "Das also suggested expanding the accessibility of Central Bank Digital Currency (CBDC) to a wider range of customers by enabling non-bank payment system operators to provide CBDC wallets.",
   "Additionally, India's UPI services have also been introduced in Sri Lanka, Mauritius, and Nepal."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/03\/full\/1712116577-4549.jpg"
 },
 {
  "headlines":"PhonePe partners with eSewa, HAN Pokhara to promote UPI service in Nepal",
  "content":[
   "Fintech firm PhonePe on Wednesday said it has partnered with Nepal's digital wallet service eSewa and the Hotel Association of Nepal (HAN) Pokhara to promote digital payments through UPI on the Himalayan country's payment processor Fonepay Network.",
   "The partnership is a part of the Fewa New Year Festival which will be held from April 11-14 in Nepal.",
   "Over 3,000 merchants will participate in the festival with more than 1,00,000 visitors expected to visit.",
   "PhonePe in a statement said it will run on-ground activation aimed at raising awareness about digital payments among local merchants while demonstrating the convenience of digital payments for customers.",
   "With kiosks showing how to use digital payments and other interactive activities, PhonePe along with eSewa and HAN Pokhara will showcase the ease of UPI (Unified Payments Interface) payments.",
   "\"Our focus will be on creating merchant education and awareness to ensure the uptick of UPI on the Fonepay Network in Nepal,\" said Ritesh Pai, CEO International Payments, PhonePe."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2020-02\/14\/full\/1581695819-2603.png"
 },
 {
  "headlines":"Rupee appreciates 15 paise to 83.16 against US dollar in early trade",
  "content":[
   "The rupee appreciated 15 paise to 83.16 against the US dollar in early trade on Wednesday, tracking its Asian peers amid a positive trend in domestic equities.",
   "Forex traders said investor sentiments got a boost as crude oil prices retreated from their elevated levels.",
   "At the interbank foreign exchange market, the local unit opened at 83.23 against the greenback. It later touched 83.16 in initial trade, registering a rise of 15 paise from its previous close.",
   "On Monday, the rupee settled on a flat note at 83.31 against the US dollar.",
   "Forex and money markets were closed on Tuesday on account of 'Gudhipadwa'.",
   "\"The Indian rupee is expected to rise to 83.21 levels as the dollar remained sideways and Asian currencies rose this morning,\" said Anil Kumar Bhansali, Head of Treasury and Executive Director, Finrex Treasury Advisors LLP.",
   "Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was trading at 104.14.",
   "Brent crude futures, the global oil benchmark, rose 0.04 per cent to USD 89.46 per barrel.",
   "The Brent oil was down slightly from its elevated levels as signs of potential build-up in US inventories and the market watching for progress in ceasefire talks between Israel and Hamas.",
   "Asian currencies all gained as CNH rose to 7.2397 levels as markets await US CPI data which is expected to come at 3.4 per cent against last month data of 3.2 per cent, Bhansali said, adding that the US FOMC meeting minutes are also to be released tonight alongside the Federal Budget Balance.",
   "On the domestic equity market front, The 30-share BSE Sensex climbed 273.65 points to 74,957.35 in early trade. The NSE Nifty advanced 83.85 points to 22,726.60.",
   "Foreign Institutional Investors (FIIs) were net sellers in the capital markets on Tuesday as they offloaded shares worth Rs 593.20 crore, according to exchange data."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/01\/full\/1711938680-865.jpg"
 },
 {
  "headlines":"High base, change in product mix to weigh on life insurers' margin in Q4",
  "content":[
   "High base and a change in product mix are expected to impact margins of life insurance companies during the last quarter of fiscal year 2023-24 (Q4 FY24), according to analysts.",
   "In March 2023, there was a surge in the sale of high value non-participating policies after the Union Government’s revision in taxation norm. The government removed the tax exemption on the maturity amount of insurance policies (excluding unit linked insurance plans or ULIPs) with an aggregate premium exceeding Rs 5 lakh. The norm came into effect on April 1, 2023.",
   "This move triggered a shift in the product mix of the life insurers towards ULIPs and other participating products. According to analysts at Nuvama Institutional Equities the life insurers are likely to see 353bps Year-on-Year (YoY) decline in VNB Margin owing to this change towards low margin linked products and decline in product-level margins in non-linked products.",
   "The VNB (Value of New Business) is a measure of economic value of the profits expected to emerge from new business. ",
   "Similarly, analysts at Emkay Global expect a moderation in VNB Margins during Q4 FY24 due to interest rate fluctuations in this year apart from transition in product mix of the insurers.",
   "Analysts at Emkay Global expect the largest private sector life insurer, SBI Life Insurance, to report VNB Margin at 26.2 per cent as compared to 31.6 per cent. Whereas, HDFC Life’s VNB Margin is likely to remain broadly flat at 29.7 per cent as compared to 29.3 per cent in Q4 FY23.",
   "ICICI Prudential Life is likely to print a drop in VNB Margin to 22.9 per cent from 32 per cent last year. Similarly, Max Life’s VNB Margin is projected to be at 27.4 per cent as compared to 30.3 per cent in Q4 FY23.",
   "The biggest life insurance company, Life Insurance Corporation of India’s VNB margin is also likely to inch down to 17.5 per cent from 19.2 per cent in the year-ago period.",
   "On the other hand, the non-life insurers are expected to see an improvement in their profitability, combined ratio in Q4 FY24, owing to reduced natural catastrophes and lower claims ratio."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/09\/full\/1712651734-3696.jpg"
 },
 {
  "headlines":"Majority customers surveyed admit facing cashback trap online: Report",
  "content":[
   "A majority of customers who were part of a survey said they were lured to an online platform that offered cashback and subscription, but they were not paid after they signed up, a report said on Tuesday.",
   "Central Consumer Protection Authority (CCPA) has identified 13 types of \"dark patterns\" that amount to misleading advertisement or unfair trade practice or violation of consumer rights, including subscription trap, bait and switch, drip pricing, etc.",
   "The report by LocalCircles said that \"62 per cent users of online payment platforms surveyed experienced the bait and switch approach where a cashback was advertised to lure them but never actually paid after they signed up\/conducted the specified transaction.\"The firm said it received over 45,000 responses from users of online payment platforms from across 376 districts of India.",
   "According to the survey, 67 per cent users of online payment platforms surveyed have experienced subscription traps where once they added\/linked their bank account for UPI payments they found it hard to remove or delink it.",
   "The government has prohibited dark patterns on online platforms since December 2023."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2023-06\/13\/full\/1686672281-7874.jpg"
 },
 {
  "headlines":"High base, change in product mix to weigh on life insurers' margin in Q4",
  "content":[
   "High base and a change in product mix are expected to impact margins of life insurance companies during the last quarter of fiscal year 2023-24 (Q4 FY24), according to analysts.",
   "In March 2023, there was a surge in the sale of high value non-participating policies after the Union Government’s revision in taxation norm. The government removed the tax exemption on the maturity amount of insurance policies (excluding unit linked insurance plans or ULIPs) with an aggregate premium exceeding Rs 5 lakh. The norm came into effect on April 1, 2023.",
   "This move triggered a shift in the product mix of the life insurers towards ULIPs and other participating products. According to analysts at Nuvama Institutional Equities the life insurers are likely to see 353bps Year-on-Year (YoY) decline in VNB Margin owing to this change towards low margin linked products and decline in product-level margins in non-linked products.",
   "The VNB (Value of New Business) is a measure of economic value of the profits expected to emerge from new business. ",
   "Similarly, analysts at Emkay Global expect a moderation in VNB Margins during Q4 FY24 due to interest rate fluctuations in this year apart from transition in product mix of the insurers.",
   "Analysts at Emkay Global expect the largest private sector life insurer, SBI Life Insurance, to report VNB Margin at 26.2 per cent as compared to 31.6 per cent. Whereas, HDFC Life’s VNB Margin is likely to remain broadly flat at 29.7 per cent as compared to 29.3 per cent in Q4 FY23.",
   "ICICI Prudential Life is likely to print a drop in VNB Margin to 22.9 per cent from 32 per cent last year. Similarly, Max Life’s VNB Margin is projected to be at 27.4 per cent as compared to 30.3 per cent in Q4 FY23.",
   "The biggest life insurance company, Life Insurance Corporation of India’s VNB margin is also likely to inch down to 17.5 per cent from 19.2 per cent in the year-ago period.",
   "On the other hand, the non-life insurers are expected to see an improvement in their profitability, combined ratio in Q4 FY24, owing to reduced natural catastrophes and lower claims ratio."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/09\/full\/1712651734-3696.jpg"
 },
 {
  "headlines":"Muthoot Microfin's AUM rose 32% YoY in Q4, loan disbursement highest ever",
  "content":[
   "Kochi-based microfinance institution, Muthoot Microfin’s assets under management (AUM) posted a 32 per cent year-on-year (YoY) growth in the quarter ended on March 31, 2024.",
   "The AUM in the March quarter soared to Rs 12,194 crore as compared to Rs 9,208 crore during the same period a year ago. ",
   "In FY24, the company recorded its highest ever loan disbursements in a single financial year. The disbursements rose by 32 per cent YoY to Rs 10,662 crore from Rs 8,104 crore in the year ago period.",
   "In the exchange filing, the company said that it has observed substantial growth both during the last quarter and financial year. “FY24 marked a healthy mix of credit expansion, rising margins and declining credit cost. Asset quality remained robust during the year.”",
   "For the fiscal year under review, the Collection Efficiency (CE) of the company stood at 98.4 per cent increasing 260 bps from 95.8 per cent in the fiscal year 2022-23.",
   "Active customer count of the company expanded by 21 per cent to 3.35 million as of March 31, 2024 from 2.77 million customers as of March 31, 2023. In the current fiscal, Muthoot Microfin added 1 million new customers.",
   "Also, the cumulative downloads of Mahila Mitra app reached 1.63 million customers.",
   "The branch count of the company grew by 29 per cent over the previous year, reaching 1,508. Recently, the company opened new branches in Telangana along with expanding its presence in other states including Uttarakhand and Himachal.",
   "During FY24, Muthoot Microfin availed Rs 9,242 crore through various instruments. It also has un-availed sanctions of Rs 2,112 crore as of March 31, 2024. ",
   "On its plans for next financial year, the company noted, “Our key focus areas for the next year include Assets Under Management (AUM) Growth, Asset Quality, Digital inclusion, Customer retention and geographic expansion.”",
   "At 10:23AM, Muthoot Microfin was 0.90 per cent up at Rs 235.45 on the BSE, Monday. "
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/08\/full\/1712555861-1948.jpg"
 },
 {
  "headlines":"RBI Guv Das for greater participation of banks in rupee derivatives market",
  "content":[
   "Banks should focus on bolstering the participation of Indian entities in the rupee derivatives markets, both domestically and internationally, while maintaining a prudent approach, said Reserve Bank of India (RBI) Governor Shaktikanta Das on Monday.",
   "He said despite some progress, the involvement of domestic banks in the derivative markets remained constrained, with only a limited number of active market-makers.",
   "Das said while Indian banks are gradually increasing their presence in the global markets, their footprint remains relatively small. Currently, domestic banks predominantly interact with global market-makers rather than end-clients, and they are yet to establish themselves as significant market-makers globally.",
   "Speaking at the FIMMDA-PDAI Annual Conference on Monday, he said, “Participation of domestic banks in derivative markets remains limited with only a small set of active market-makers. Participation of Indian banks in global markets is growing but it is quite small.\"",
   "“Going forward, our focus should be on enhancing and widening the participation of Indian players in markets for rupee derivatives, both domestically and offshore, while being prudent,” Das said.",
   "He further said that the journey towards pricing transparency is ongoing, with room for further improvement. Retail customers still do not receive deals comparable to those offered to larger clients. Effective market-making and precise pricing for smaller transactions on the negotiated dealing system-order matching segment (NDS-OM) (a platform for trading) are essential.",
   "Disparities in pricing between small and large customers in forex (FX) markets exceed what operational factors alone can justify.",
   "Commenting that banks may need to do more to facilitate the use of the FX retail platform, Das said RBI continues to see banking channels being used by certain persons or entities to fund activities on unauthorised FX trading platforms. “This warrants enhanced vigilance by the banks,” he said.",
   "The RBI governor highlighted six areas which call for attention. He said that liquidity within over-the-counter (OTC) derivatives markets, particularly in interest rate derivatives, remains concentrated in a few products. This limits the broader economy's ability to hedge efficiently.",
   "Moreover, the market for credit derivatives, crucial for facilitating lower-rated corporate bonds, has not yet gained significant traction.",
   "“I am, however, happy to note that the first credit-default swap (CDS) transaction — after issuance of the revised guidelines that came into effect in May 2022 — was undertaken last week. In many ways, all domestic market participants are yet to fully embrace the new regulatory framework and exploit the opportunities it presents,” he said.",
   "Das said that introduction of bond forwards is being contemplated to empower long-term investors in effectively managing interest rate risks, with draft guidelines issued in December 2023.",
   "“To foster greater efficiency, application programming interfaces (APIs) for reporting trades to NDS-OM and accessing the request for quote (RFQ) dealing mode are being contemplated. Introduction of bond forwards is being considered to enable long-term investors to manage their interest rate risks efficiently. Draft guidelines in this regard were issued in December 2023,” he said.",
   "Bank treasuries need to scale up their dynamism to utilise the opportunities presented in the context of the recent regulatory reforms. This is critical for achieving efficient market intermediation, effective management of financial risks and alignment of financial variables across different segments and markets, he said.",
   "He said efforts are being made to leverage technology for achieving greater efficiency while meeting the objectives of market reforms. The governor cited the example of RBI Retail Direct and FX Retail where the regulator is exploring the use of technological platforms to expand the reach of financial markets."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712316281-0013.jpg"
 },
 {
  "headlines":"Co-lending book of NBFCs likely to touch Rs 1 trillion mark by June",
  "content":[
   "The co-lending book of non-banking finance companies (NBFCs) is expected to reach Rs 1 trillion by June 2024 amid rising interest from partner banks and the benefit of access to funding and diversification, according to CRISIL Ratings.",
   "Ajit Velonie, senior director at CRISIL Ratings, said over the medium term, growth momentum is seen to be healthy at 35-40 per cent annually. In March 2023, the Assets Under Management (AUM) reached about Rs 55,000 crore through the co-lending arrangement.",
   "The partners may increase their focus on other asset classes such as loans to micro, small and medium enterprises (MSME) and home loans, given higher risk weights for personal loans. In November 2023, the Reserve Bank of India hiked the risk weights on exposure to unsecured credit.",
   "Velonie said co-lending is seen as a win-win for NBFCs and banks, as it allows sharing of risk and rewards. For mid-sized and small NBFCs, the co-lending model provides access to bank funding and works as an avenue for diversification. The model also allows NBFCs to grow in a capital-efficient manner.",
   "For banks, this provides optimal access to niche customers and geographies and also aids them in meeting their priority sector lending targets.",
   "Of the current overall co-lending book, personal loans alone account for about a third of the AUM, followed by housing loans at approximately 20 per cent and unsecured MSME loans and gold loans each making up around 13 per cent of the pie. Secured MSME (including loan against property) and vehicle loans comprise the rest, approximately 20 per cent.",
   "Growth will be supported by controlled asset quality seen so far in the co-lending portfolio of banks and NBFCs. CRISIL emphasises that long-term success hinges on sustaining this quality and monitoring regulatory developments."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2022-12\/12\/full\/1670867067-1709.jpg"
 },
 {
  "headlines":"India 10-year bond yield hits over 2-month high tracking US peers surge",
  "content":[
   "Indian bond yields rose on Monday, with the 10-year benchmark yield hitting a more than two-month high, tracking rise in U.S. peers as strong economic data further pushed back expectations around the timing of the first rate cut by the Federal Reserve. ",
   "The benchmark 10-year yield ended at 7.1501%, the highest level since Jan. 31, following Friday's close of 7.1232%. ",
   "Investors now await domestic and U.S. March inflation data, due later this week for further cues. ",
   "India's headline retail inflation print is seen at 4.7% on-year in March, the lowest since May 2023, amid easing core inflation, Barclays said. ",
   "\"The next policy step is likely to be easing, with inflation expected to move towards the target rate in FY25. However, the Reserve Bank of India is unlikely to be in a hurry to cut policy rates with growth showing no adverse impact of current policy rates,\" IDFC First Bank economist Gaura Sengupta said.",
   "ALSO READ: HSBC helps overseas funds navigate India's bond market as inclusion nears",
   "U.S. yields jumped on Friday after data showed non-farm payrolls grew by 303,000 jobs in March compared with expectations for a 200,000 increase, while the unemployment rate slipped to 3.8% compared with forecasts of 3.9%. ",
   "The 10-year yield was over 4.40%, after hitting its highest level in more than four months. ",
   "The data has further raised uncertainty over the timing of rate cuts, with the odds of a June action now dropping below 50%, while bets for aggregate cuts of 75 bps in 2024 also eased below the halfway mark, according to the CME FedWatch tool. ",
   "\"In case the Fed rate cut cycle gets delayed due to adverse U.S. inflation prints, the RBI rate cut cycle could also get delayed,\" Sengupta said. ",
   "Last week, the RBI kept interest rates unchanged for a seventh straight policy meeting as growth is expected to remain robust while inflation stays above the 4% target. ",
   "Traders are also monitoring oil prices, with the benchmark Brent crude contract hovering near $90 per barrel. Higher commodity prices could impact retail inflation."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-03\/04\/full\/1709573886-6448.jpg"
 },
 {
  "headlines":"Edelweiss Financial's Rs 200 cr NCD issue opens, to have 9-10.5% yield",
  "content":[
   "Edelweiss Financial Services said its Rs 200 crore public issue of debentures opened on Monday.",
   "The non-convertible debentures (NCDs) will have an effective annual yield of 9 per cent to 10.46 per cent. The issue will close on April 23.",
   "The NCDs carry fixed coupons and have a tenure of 24 months, 36 months, 60 months, and 120 months with annual, monthly, and cumulative interest options, Edelweiss Financial Services said in a statement.",
   "\"Edelweiss Financial Services has announced the opening of the public issue of Secured Redeemable Non-Convertible Debentures (NCDs) of the face value of Rs 1,000 each for an amount up to Rs 1,000 million (base issue size), with a greenshoe option of up to Rs 1,000 million (Rs 100 crore), cumulatively aggregating up to Rs 2,000 million (Rs 200 crore),\" it said.",
   "At least 75 per cent of the funds raised through the issue will be used for the purpose of repayment\/prepayment of interest and principal of existing borrowings of the company and the balance amount will be utilised for general corporate purposes, Edelweiss Financial said. ",
   "ALSO READ: Smallcap firm Ramky Infrastructure soars 7% on raising Rs 300 cr via NCDs"
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-03\/04\/full\/1709573886-6448.jpg"
 },
 {
  "headlines":"Overnight swaps suggest RBI likely to hold interest rates through 2024",
  "content":[
   "Indian overnight indexed swap (OIS) rates have moved higher since the Reserve Bank of India's latest policy meeting on Friday, suggesting investors now expect a rate cut only in early 2025 as opposed to the last quarter of 2024 earlier.",
   "The one-year OIS rate, the most commonly used indicator to gauge interest rate expectations, was at 6.82 per cent by 0700 GMT, its highest since December 13. The five-year rate was at 6.48 per cent, also its highest in four months.",
   "OIS markets reflect interest rate expectations, with higher rates indicating elevated interest rates for a longer period.",
   "\"In our view, the Monetary Policy Committee (MPC) should not be thinking of rate cuts at this stage at all, and should wait for more information about domestic and global conditions before thinking of stance change and rate cut,\" said A Prasanna, head of research at ICICI Securities Primary Dealership.",
   "The central bank's MPC held rates steady on Friday as expected, for a seventh straight policy, as growth was seen staying robust while inflation has remained above its 4 per cent target.",
   "Robust growth will allow the RBI to focus on the last mile of disinflation towards the target, which is most challenging, Governor Shaktikanta Das said.",
   "Traders said the market viewed the commentary from the Governor and other central bank officials as slightly hawkish, prompting the one-year swap rate to move up more than 20 basis points since the Feb. 8 meeting.",
   "ICICI Securities PD sees a risk of a delayed start to rate easing, with a reasonable probability of a status quo in the current calendar year.",
   "Apart from the RBI's rhetoric about meeting the 4 per cent inflation target, traders also think the market expectations of easier liquidity conditions in April-June may not meet estimates, a trader with a foreign bank said, adding that this was also pushing up swap rates.",
   "\"Mathematically, we can foresee one rate cut in the one-year swaps, but that is largely towards the end of the financial year, probably in January-March,\" said Alok Singh, group head of treasury at CSB Bank."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302989-534.jpg"
 },
 {
  "headlines":"Rupee rises 8 paise to 83.23 against US dollar in early trade today",
  "content":[
   "The rupee appreciated 8 paise to 83.23 against the US dollar in early trade on Monday, supported by positive domestic equities and fresh foreign fund inflows.",
   "Forex traders said investor sentiments got a boost as crude oil prices retreated from their elevated levels, while the strength of the American currency in the overseas market weighed on the local unit and restricted the up move.",
   "At the interbank foreign exchange market, the local unit opened at 83.27 against the greenback. It later touched 83.23 in initial trade, higher 8 paise from its previous close.",
   "On Friday, the rupee appreciated 8 paise to close at 83.31 against the US dollar as the Reserve Bank of India kept the benchmark interest rate unchanged at 6.5 per cent for the seventh time in a row.",
   "The rupee is expected to trade in a range as the Reserve Bank continues to protect it from falling further while inflows may bring it to 83.20, Anil Kumar Bhansali, Head of Treasury and Executive Director, Finrex Treasury Advisors LLP said.",
   "Market participants are awaiting key macroeconomic data from the domestic as well as global front for further cues.",
   "On the domestic front, CPI, IIP and WPI are scheduled to be released this week, while on the global front forex traders will keep a watch on US CPI data.",
   "Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was trading 0.05 per cent higher at 104.34.",
   "Brent crude futures, the global oil benchmark, fell 1.61 per cent to USD 89.70 per barrel.",
   "On the domestic equity market front, the 30-share BSE Sensex scaled a fresh lifetime high of 74,658.95. The Nifty climbed to its new all-time peak of 22,623.90.",
   "Foreign Institutional Investors (FIIs) were net buyers in the capital markets on Friday as they purchased shares worth Rs 1,659.27 crore, according to exchange data.",
   "India's foreign exchange reserves increased by USD 2.951 billion to USD 645.583 billion for the week ended March 29, the Reserve Bank of India (RBI) said on Friday.",
   "This is the sixth consecutive week of a jump in overall reserves. The kitty had increased by USD 140 million to USD 642.631 billion in the previous week."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2023-04\/13\/full\/1681405549-1511.jpg"
 },
 {
  "headlines":"RBI to offer CBDC-R accessible to non-bank payments system operators",
  "content":[
   "The Reserve Bank of India (RBI) on Friday proposed to make CBDC-R (CBDC-Retail) accessible to a broader population by allowing non-bank payment system operators to offer CBDC wallets.",
   "Non-bank payment system operators include third-party payment applications like Phone Pe, Google Pay, etc.",
   "According to RBI, this move is expected to enhance access and expand choices available to the users apart from testing the system resilience to handle multi-channel transactions.",
   "According to experts, this step from the apex bank is in the right direction as CBDC will aid in financial inclusion and boost innovation.",
   "V. Balasubramanian, CEO, FSS Cash Tech, said, “For higher adoption of CBDC, it is important that it is accessible and usable by diverse sections of our society. This will be further enhanced when customers have a wide array of CBDC wallets to choose from once non-bank payment system operators foray into this area. This move widens the playing field and can turn CBDC into a mainstream payment option in the foreseeable future.”",
   "ALSO READ: CBDC transaction volumes decline after hitting 1,000,000: RBI dy guv",
   "RBI launched the CBDC pilot programme in 2022. The Indian CBDC, also known as Digital Rupee, is a tokenised digital version of the Rupee issued by RBI.",
   "The pilots for CBDC Wholesale and Retail segments are ongoing, with more and more banks being roped in.",
   "During the post-policy press meet, Deputy Governor T Rabi Sankar noted that even though the volumes of CBDC have come down from 1 million, there is a visible shift in transactions from P2P to P2M as more and more merchants participate.",
   "According to Sankar, there are nearly 46 lakh users in CBDC and 4 lakh merchants, with a total of around 50 lakh participants. So far, the total transactions through CBDC have reached 2.2 crore.",
   "During the (Monetary Policy Committee) MPC meeting in February 2024, RBI had proposed to enable additional functionalities of programmability and offline capability in CBDC retail payments.",
   "As per RBI, programmability in CBDC was expected to facilitate transactions for specific or targeted purposes, whereas offline functionality enabled these transactions in areas with poor or limited internet connectivity.",
   "In the press meet, Rabi Sankar noted the first use case of programmability has started on Friday, which is a use case for farmers to transact through CBDC, which can be used for their inputs. Offline transactions have already been developed and are being tested in a closed group within banks, which will be open once the setup is ready.",
   "Also, RBI’s implementation of interoperability between CBDC and United Payments Interface (UPI) has aided in driving the overall CBDC volumes.",
   "“Last year, we said that we wanted to test the resilience of the system when transactions rose to 1 million. We had set that target for the end of the year and we achieved that target. Interoperability with UPI has been useful in achieving that target,” Sankar added."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302989-534.jpg"
 },
 {
  "headlines":"RBI to launch a mobile app for investing in government securities",
  "content":[
   "Reserve Bank of India Governor Shaktikanta Das on Friday announced plans for the launch of a mobile app for accessing the Retail Direct Scheme to engage in the government securities market. Das highlighted in his monetary policy statement that the introduction of the app will significantly enhance convenience for retail investors and contribute to the deepening of the G-sec market.",
   "“It is now proposed to launch a mobile app for accessing the Retail Direct portal. This will be of greater convenience to retail investors and deepen the G-sec market,” he said.",
   "Presently, retail investors have the option to invest in various financial instruments such as central government securities, treasury bills, state government securities, sovereign gold bonds, and floating rate saving bonds through the retail direct portal.",
   "The introduction of the app will enhance transparency and streamline the process for retail investors, said market participants. They believe that the RBI's app will foster a fairer environment in the G-sec market. However, some express concerns that it could disrupt the market and present a notable challenge to market intermediaries.",
   "ALSO READ: Stability in G-sec yields bolstered financial mkt resilience: FM Sitharaman",
   "“The introduction of a mobile app granting direct access to the retail portal for Government Securities (G-Secs) represents a proactive stride towards democratising investment opportunities, empowering individuals to participate more enthusiastically in the financial markets,” said Umesh Revankar, Executive Vice Chairman at Shriram Finance.",
   "Market participants said that retail investors may feel more secure using the RBI's app, given its operation within a regulated framework. If the RBI's app provides lower transaction costs or even offers zero-cost transactions compared to other market intermediaries offering similar products, it could attract retail investors seeking to optimise their returns, they said.",
   "“As a regulator, the RBI ensures compliance with regulatory requirements and safeguards investor interests. Retail investors may feel more secure using the RBI's app knowing that it operates within a regulated framework. If the RBI's app offers lower transaction costs or zero cost compared to other market intermediaries who offer the same products, it could attract retail investors looking to maximise their returns,” said Venkatakrishnan Srinivasan, founder and managing partner of Rockfort Fincap LLP.",
   "The retail investors continue to invest more in treasury bills as compared to instruments like state and central government securities, and sovereign gold bonds through the scheme.",
   "As of April 1, 67 per cent of the total subscriptions were channelled through T-bills, whereas only 14 per cent of subscriptions were through central government dated securities. Subscriptions through state government securities and sovereign gold bonds were 8 per cent and 7 per cent respectively. The subscriptions through floating rate saving bonds stood at 3 per cent."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-03\/04\/full\/1709573886-6448.jpg"
 },
 {
  "headlines":"Monetary policy: Review of liquidity ratio framework for banks on the cards",
  "content":[
   "Viewing the sudden withdrawal of deposits through digital banking channels, the Reserve Bank of India (RBI) has decided to review the liquidity ratio framework for banks and issue a draft circular shortly for public comments.",
   "Banks covered under the Liquidity Coverage Ratio (LCR) framework must maintain a stock of high-quality liquid assets (HQLA) to cover the expected net cash outflows in the next 30 calendar days. Securities eligible for statutory liquidity ratios, like central and state government bonds, are reckoned as HQLA to calculate LCR. Banks have to maintain 100 per cent LCR.",
   "“…the recent episodes in some jurisdictions have demonstrated the increased ability of the depositors to withdraw or transfer deposits during times of stress, using digital banking channels. Such emerging risks may require revisiting certain assumptions under the LCR framework,” the RBI said. It added that certain modifications to the LCR framework are being proposed to facilitate better management of liquidity risk by the banks.",
   "“The review of the LCR framework with 24\/7 payment systems could act as a positive enabler to address frictional liquidity mismatches,” State Bank of India chairman Dinesh Khara said.",
   "According to Zarin Daruwala, CEO, India & South Asia, Standard Chartered Bank, the review of the LCR framework will better capture liquidity risks arising from a wider adoption of digital transaction channels and strengthen the banking system."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302989-534.jpg"
 },
 {
  "headlines":"No change in policy, some 'misusing' currency derivatives norms: RBI",
  "content":[
   "Justifying the recent norms on exchange-traded currency derivatives, the Reserve Bank of India Deputy Governor Michael Patra said that the relaxation in documentary evidence requirements is being misused by some market participants as implying a lack of underlying exposure, which is incorrect and constitutes a violation.",
   "He said that the RBI's policy on foreign exchange risk management has stayed consistent in recent years, maintaining an unchanged approach. In 2008, when exchange-traded currency derivatives (ETCDs) debuted, they functioned under the Foreign Exchange Management Act. FEMA regulations explicitly outlined that ETCDs are designed exclusively for hedging purposes, indicating the imperative of having an underlying exposure.",
   "“In 2014, the RBI aimed to facilitate ease of doing business by providing a relaxation. While underlying exposure is still required, for exposures up to 10 million, documentary evidence is not mandatory. Since then, over the next few years, that limit was raised to 100 million just to provide an incentive for market turnover and to expand the size of the market. But the main point is that it is only for hedging, and underlying exposure is a mandatory requirement,” said Patra. “The January 5, 2024, circular was issued in pursuance of a commitment made in the monetary policy statement of December 2023, in which we stated that there are various stipulations scattered throughout. We will consolidate them into a master direction, and the January 24 circular served as such. It simply reiterated what has been in place since 2014, so there was no change in that. Now, some market participants have been misinterpreting this to mean that a relaxation in documentary evidence is equivalent to having no underlying exposure, which is not the case. And that constitutes a violation of the law,” he added.",
   "ALSO READ: RBI to review liquidity coverage ratio framework, issue a draft circular",
   "The Reserve Bank of India (RBI) on Thursday deferred the implementation of norms on exchange-traded currency derivatives (ETCDs) linked to the Indian rupee until May 3, following concerns by investors. The norms were scheduled to take effect starting Friday. Now, rupee-denominated currency contracts traded on the National Stock Exchange (NSE) and the BSE require underlying exposure. Though traders are not required to provide evidence of underlying exposure for positions up to $100 million, they must confirm the existence of such exposure.",
   "Supplementing Deputy Governor Patra, RBI Governor Shaktikanta Das reiterated that there have been no changes to RBI's policy, emphasising that the necessity of underlying exposure has always been a fundamental aspect. He clarified that the reasons behind the issuance of recent circulars and the extension of implementation deadlines were in response to market feedback and requests for more time.",
   "“There is no change pursuant to yesterday's (Thursday) circular or even earlier. There has been no change in RBI's policy. This policy of needing to have an underlying has always been a part of RBI's policy for the last so many years, so there was no change. And this is something that every market player knew. You cannot say that this is something new. If you read the circulars, past circulars very carefully, it has always been there. So, therefore, if somebody says it is new, it is not correct,” he said.",
   "Transactions in currency futures were primarily driven by the retail segment who couldn't transact in OTC markets because banks demanded proof of underlying exposure, which they didn’t have. These retail trades accounted for more than 50 per cent of total transactions and contributed significantly to liquidity in exchange-traded currency futures.",
   "“Majority markets require both segments of participants, the commercials and non-commercials. Even in the overseas market, there is a huge chunk of non-commercials,” said Hitesh Jain, strategist, institutional equities research, YES Securities India. “I really can't really read too much what the RBI members are trying to convey, but I can say there is a need for both segments of the market,” he added.",
   "There was significant volatility in the rupee’s exchange-traded derivatives in the current week as brokers advised their clients to either unwind positions or provide evidence of underlying forex exposure.",
   "“In the earlier regulation, as DG Patra has said, that provision was there, but there was no cut-off date,” said Ritesh Bhansali, vice-president at Mecklai Financial Services. “The RBI wanted to ensure there was no excess speculation and they came up with the cut-off date,” he added."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2022-01\/29\/full\/1643397174-0816.jpg"
 },
 {
  "headlines":"RBI's MPC decision shows resolve to ensure price stability, say experts",
  "content":[
   "Reserve Bank's monetary policy decision of keeping the key interest rate unchanged and focus on moderating inflation shows a resolve on the part of the central bank to ensure price stability and sustained economic growth, experts opined on Friday.",
   "The RBI kept the benchmark interest rates unchanged at 6.5 per cent for the seventh time in a row, citing concerns over food inflation in view of IMD's prediction of above-normal maximum temperatures from April to June. ",
   "As the central bank held key policy rates steady, the EMIs on home and auto loans are likely to remain stable for some more time. The RBI has kept interest rates unchanged since February 2023. ",
   "\"We stand by RBI's commitment for 'unwavering focus on price stability' to ringfence the economy from global headwinds, including geo-political situation and the resultant supply chain disruptions,\" Assocham Secretary General Deepak Sood said. ",
   "The central bank has successfully shielded the economy from global uncertainties over the past few years, he added. ",
   "President of industry body PHDCCI Sanjeev Agrawal too said the RBI's decision on its policy rates will propel economic activity and boost economic growth. ",
   "\"We expect a repo rate cut as and when headline inflation softens around 4.5 per cent,\" he said.",
   "ALSO READ: RBI MPC keeps repo rate unchanged: What home loan borrowers must do now",
   "The RBI also retained its growth and inflation forecast for the current fiscal at 7 per cent and 4.5 per cent, respectively.",
   "Raoul Kapoor, Co-CEO of Andromeda Sales and Distribution, the RBI governor highlighted how inflation is gradually decreasing and emphasised the robust growth in India's economic landscape. ",
   "\"These domestic conditions of diminishing inflation and promising growth prospects set the stage for a potential rate cut. We anticipate that in the upcoming MPC meetings, the RBI will likely announce a rate cut ranging from 25 to 50 basis points, provided the current conditions continue to improve,\" he said. ",
   "Commenting on the monetary policy, S K Narvar, Group Chairman of Trident Realty, said the RBI's decision reflects a strategic approach aimed at nurturing economic recovery and fostering stability. ",
   "\"This move is set to benefit potential homebuyers by ensuring affordability and sustaining momentum in the housing market.With consumer demand driving the real estate sector, especially in luxury housing, the decision to maintain the repo rate status quo supports feasible macroeconomic indicators and encourages new homebuyers to invest in property,\" Narvar said. ",
   "HS Bhatia, managing director, Kelwon Electronics and Appliances Pvt Ltd, the manufacturing partner of Daewoo India, opined that while the RBI's decision to hold the repo rate is positive for consumer durables, a wait-and-watch approach might emerge. ",
   "\"Consumers may prioritise essentials if inflation remains a concern. However, a strong 7 per cent GDP growth (projection) is a confidence booster,\" he added. ",
   "Ayush Lohia, CEO of Lohia Auto, was of the opinion that the central bank's decision offers a sense of steadiness within the broader economic framework. ",
   "\"Within the EV sector, stable interest rates can have a favourable influence on the accessibility and financing of electric vehicles, stimulating greater consumer adoption of cleaner transportation alternatives. This corresponds with our objective of advancing sustainable mobility and mitigating carbon emissions,\" he added.",
   "ALSO READ: RBI monetary policy highlights: Last mile of disinflation is always challenging, sticky, says Governor Das",
   "While unveiling the monetary policy, RBI Governor Shaktikanta Das also announced several other developmental and regulatory measures. ",
   "Das announced that certain modifications to the Liquidity Coverage Ratio (LCR) framework are proposed towards facilitating better management of liquidity risk by banks. ",
   "Anil Gupta, Senior Vice President, Co Group Head-Financial Sector Ratings at ICRA, said typically the savings deposits attract a lower outflow rate of 5 per cent in the next 30 days while calculating the LCR. ",
   "However, the saving deposits mobilised through higher interest rates on saving accounts are not only interest sensitive but may also be prone to higher run-off in any adverse development at a bank, he said. ",
   "\"Further, the actual outflow rates for some of the saving deposits may also be higher than 5 per cent and hence the proposal to review the LCR framework is positive from the liquidity risk management of banks,\" Gupta said. ",
   "Parijat Agrawal, Head - Fixed Income at Union Mutual Fund, expects interest rate cuts in the third quarter of the fiscal. He also said the RBI is expected to keep liquidity neutral so that further transmission of higher rates can continue. ",
   "Nilesh Shah, MD at Kotak Mahindra AMC, said the RBI has achieved the objective of stability, trust and growth. ",
   "Growth is higher than market expectations, Shah said, and added the market trusts the RBI to lower the inflation to midpoint.",
   "The Reserve Bank will be releasing the minutes of the MPC meeting on April 19. ",
   "The next meeting of the MPC is scheduled during June 5 to 7, 2024."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-02\/09\/full\/1707417686-6304.jpg"
 },
 {
  "headlines":"CBDC transaction volumes decline after hitting 1,000,000: RBI dy guv",
  "content":[
   "The Central Bank Digital Currency (CBDC) transaction volumes have gone down after crossing 10 lakh in late-December 2023, Reserve Bank of India Deputy Governor T Rabi Sankar said on Friday.",
   "The overall number of transactions has touched 22 million since the launch of the CBDC pilot on December 1, 2022, Sankar said, adding that the number of participants in the pilot stands at 5 million.",
   "\"Volumes have not been the same, they have come down,\" Sankar said, adding that the target of 10 lakh a day was met earlier on the back of measures such as interoperability with a very popular UPI platform.",
   "As per a news report, banks disbursed employee benefits using the digital rupee in December, which helped the Reserve Bank of India (RBI) meet its target of 10 lakh daily transactions.",
   "Sankar said there are 46 lakh users and 4 lakh merchants transacting in CBDC right now, and added that as the acceptance of CBDC grows, there has been a growth in the P2M, or peer-to-merchant, transactions.",
   "\"Volumes are shifting from P2P (peer to peer) to P2M as more merchants are available,\" Sankar said.",
   "Sankar also said the programmability feature on the CBDC kickstarted on Friday, with a use case, where a farmer was transferred money designed specifically for buying agricultural inputs.",
   "A closed-user group within the bank is testing newly developed offline CBDC use cases, Sankar said, adding that the same will be launched for the public later.",
   "It can be noted that earlier in the day, RBI Governor Shaktikanta Das had proposed to make CBDC-retail accessible to a broader segment of users by enabling non-bank payment system operators to offer CBDC wallets.",
   "The move will facilitate testing of the resiliency of CBDC platform to handle multi-channel transactions, Governor Shaktikanta Das had said."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2023-03\/16\/full\/1678967042-3679.jpg"
 },
 {
  "headlines":"RBI turns down request to remove 'small finance' tag from bank name",
  "content":[
   "The Reserve Bank of India (RBI) has turned down the request from small finance banks (SFB) to drop the “small finance” tag from their name, saying that SFBs are differentiated banks with specific objectives like financial inclusion.",
   "“SFBs have been conceptualised as differentiated banks with specific objectives. The tag of having an SFB after their name is a key part of that differentiator. So, I do not think there is any requirement to modify that at this point in time,” said M. Rajeshwar Rao, deputy governor, RBI, in post monetary policy media interaction.",
   "Also, the objective of these entities (SFBs) was to further financial inclusion among the underserved and unserved through high-tech and low-cost operations.SFBs seek glide path from RBI to become universal banks citing eligibility",
   "“Meeting the priority sector lending (PSL) norm was a key part of the entire process. So, the norms continue to be at that level for PSL,” he added.",
   "SFBs had pointed out the challenges arising from the “small” nomenclature, which is associated with them. They said extending loans is not an issue, but depositors are at times wary of such a tag.",
   "In an interaction with the regulator, SFB officials argued that banks can continue with what they are mandated to do, that is catering to small customers without the small tag. This removes the ambiguity that may be there in the depositor’s mind.",
   "SFBs are niche banks with a minimum net worth of Rs 200 crore, lower than other scheduled commercial banks (SCBs).",
   "Considering their focus on financial inclusion, SFBs are required to lend at least 75 per cent of their adjusted net bank credit (ANBC) to priority sectors. This compares to 40 per cent in case of other SCBs.",
   "Meanwhile, as a step to enhance SFBs’ capacity to manage interest rate risks, RBI has allowed them to deal in rupee interest derivative products.",
   "This is also expected to help hedge interest rate risks in their commercial operations more effectively and provide greater flexibility. At present, SFBs can use only interest rate futures (IRFs) for proprietary hedging."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/04\/full\/1712171387-3248.jpg"
 },
 {
  "headlines":"RBI to release final framework for fintech SROs by April-end: Governor Das",
  "content":[
   "The Reserve Bank of India (RBI) will release the framework for a self-regulatory organisation (SRO) for fintechs by the end of April, RBI Governor Shaktikanta Das said during the post-monetary policy press conference. ",
   "Das said the banking regulator was working towards operationalising one SRO for fintechs by the Global Fintech Festival (GFF) scheduled in September.  ",
   "“As I had mentioned in last year’s GFF, we would like one SRO relating to fintech to be operational. We are working towards that,” he said. ",
   "An SRO is a non-governmental organisation that acts as a bridge between industry players and the regulator. It also sets standards for the conduct of entities operating in the country. SROs must promote a culture of compliance among members, says RBI",
   "RBI Deputy Governor T Rabi Sankar said the banking regulator was examining the comments from stakeholders on the draft framework for recognising SROs for the fintech sector. ",
   "“On the SRO (for) fintechs, we have received comments. The last date to send them was by the end of February. We are examining those comments. We will be out with a framework based on which entities can apply for SRO,” he said. ",
   "Industry groups seeking to be an SRO for the fintech sector have cheered the RBI’s timeline to release the final framework. ",
   "“The RBI has been systematically driving the conversation on the SROs to this point. The governor mentioned a time-bound approach to operationalise the SRO-FT. We eagerly await the final framework, knowing SRO reality is getting closer is hugely encouraging,” said Sugandh Saxena, chief executive officer (CEO), Fintech Association for Consumer Empowerment (FACE), an industry body for digital lenders. ",
   "Jatinder Handoo, CEO, Digital Lenders Association of India (DLAI) said, “The industry association would study the final SRO-FT framework, when released, and take steps accordingly.” ",
   "Handoo added the association had seen a rise in queries for regulatory guidance. "
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712316281-0013.jpg"
 },
 {
  "headlines":"Govt to broaden e-rupee distribution beyond banks to boost retail use: RBI",
  "content":[
   "The Reserve Bank of India (RBI) plans to use non-bank payment system operators, including third-party payment app providers, to make the e-rupee more accessible to retail users, it said on Friday.",
   "The RBI piloted its central bank digital currency (CBDC), which uses distributed-ledger technology, in 2023 but only allowed banks to offer these tokens, which led to subdued transaction volumes.",
   "It has now proposed that non-bank payment system operators, which include third-party payment app providers like PhonePe, Google Pay and Paytm, offer the e-rupee through CBDC wallets.",
   "\"This is expected to enhance access and expand choices available to users apart from testing the resiliency of the CBDC platform to handle multi-channel transactions,\" the RBI said in its Statement on Developmental and Regulatory Policies.",
   "The necessary changes will be made to the system to facilitate this, the central bank added.",
   "The RBI has made the change to help lift transaction volumes for the retail CBDC, a source familiar with the pilot said.",
   "The process is still in the early stages and the third-party apps will have to seek the RBI's approval to offer CBDC wallets, the source added.",
   "The source did not wish to be named as he was not authorised to speak with the media. The RBI did not immediately respond to an email seeking comment.",
   "Currently, there are 4.6 million retail users and 400,000 merchants using the e-rupee, RBI Deputy Governor T. Rabi Sankar said in a post-policy press conference.",
   "To boost the e-rupee's transactions, the RBI introduced new features and widened its usage, including linking it to Unified Payment Interface (UPI), the country's popular real-time payments system, and introducing programmability, which enables targeted cash transfers, such as to farmers.",
   "These alternate use cases helped boost transactions, Sankar said.",
   "Indian banks disbursed some employee benefits through the e-rupee in December, helping the RBI meet its target of one million daily transactions by end-2023, Reuters reported in January."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/04\/full\/1712210324-3885.jpg"
 },
 {
  "headlines":"RBI reiterates FX exposure must for rupee exchange derivative transactions",
  "content":[
   "India's central bank reiterated on Friday that underlying foreign exchange exposure is necessary for transacting in rupee derivatives on exchanges.",
   "The requirement of underlying exposure for rupee derivatives has always been the central bank's policy \"for the last so many years\", the central bank's Governor Shaktikanta Das said at a post policy media conference.",
   "The regulations of Foreign Exchange Management Act clearly state that exchange traded currency derivatives \"are for hedging only\", Reserve Bank of India (RBI) Deputy Governor Michael Patra said.",
   "\"When you state that, it implies that you must have an underlying exposure,\" Patra said.",
   "The central bank had, in 2014, permitted users, for the ease of doing business, to take positions of up to $100 million across exchanges without providing documentary evidence to establish the underlying exposure.",
   "\"Some market participants have been misusing this to understand that a relaxation in documentary evidence is tantamount to no underlying, which is not the case and that is a violation of the law,\" the deputy governor said.",
   "The RBI on Thursday delayed the implementation of its consolidated directions for exchange-traded currency derivatives by a month.",
   "Earlier this week, rupee's exchange-traded options went into a tizzy as brokers asked clients to submit proof of underlying exposure or unwind their existing positions.",
   " "
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302183-6566.jpg"
 },
 {
  "headlines":"Inflation targeting framework is the focus: RBI governor Shaktikanta Das",
  "content":[
   "Reserve Bank of India (RBI) Governor Shaktikanta Das stated that bringing inflation to the four per cent target was the central bank's focus going forward in the current financial year (FY25).In a press conference, the RBI Governor highlighted the importance of monitoring food price inflation, particularly in light of potential impacts from climate events temperatures this year; however, they reiterated, \"inflation targeting framework is the focus\" of the reserve bank. ",
   "Following the announcement of the monetary policy where the RBI's Monetary Policy Committee (MPC) retained the repo rate at 6.5 per cent for the seventh consecutive time, Das made the following observations:",
   "1. Inflation is moderating, and GDP growth is robust",
   "2. The MPC remains focused on aligning inflation to the target on a durable basis, deriving satisfaction from the progress made under disinflation, but the task is not yet finished.",
   "3. The financial sector continues to be stable.",
   "4. The external sector also continues to be resilient.",
   "5. \"As we move towards RBI at 100 (RBI completed 90 years earlier this year), the Reserve Bank will continue to focus on preserving stability and promoting our financial sector and a payment system that is robust, resilient, and future-ready,\" the RBI governor said.",
   "Speaking on inflation, Das said, \"The elephant moves at a slow pace. The last mile of inflation is always challenging.\"Also Read: RBI MPC: Here are the major announcements made by Governor Shaktikanta Das",
   "The Governor emphasised the priority of maintaining stability in the Indian rupee, highlighting RBI's ongoing efforts to build reserves as a buffer against future risks, thereby strengthening the national balance sheet.",
   "\"Over the last 4-5 years we have been building up our reserves depending on the prevailing market situation. And this continues because the reserves act as a buffer against future risks, especially in situations where the cycle turns and there is a significant outflow of dollars. This whole endeavour adds to the strength of the national balance sheet,\" Das said.",
   "Governor Das acknowledged the potential impact of above-normal temperatures on food crops, particularly vegetables, emphasising the need for vigilance amidst volatile food price inflation. Adding that food price inflation had been volatile with it reaching 7.8 per cent in February.",
   "The RBI said, \"The actors keep shifting, at first it was cereals, then vegetables and at the moment it is proteins... These are short-duration spikes, but since they are reoccurring they give a persistent character.\"",
   "The RBI projects CPI will be 4.5 per cent for the whole year, and growth will be seven per cent.",
   "RBI deferred implementing rules on exchange-traded forex derivatives to May 3 from April 5, on Thursday. Clarifying on this the RBI said, that there is no change in the central bank's approach to foreign exchange risk management.  ",
   "\"This has always been a part of RBI's policy. The extension of the deadline came as a response to requests from market players who needed more time,\" the RBI governor said. "
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-04\/05\/full\/1712302183-6566.jpg"
 },
 {
  "headlines":"RBI to soon launch app for retail investors to participate in govt bonds",
  "content":[
   "The Reserve Bank on Friday announced the launch of a mobile app to enable retail investors to participate in government securities (G-Secs) or government bonds market.",
   "RBI Retail Direct Scheme, launched in November 2021, gives access to individual investors to maintain gilt accounts with the RBI and invest in government securities.",
   "The Scheme enables investors to buy securities in primary auctions as well as buy\/sell securities through the Negotiated Dealing System - Order Matching system (NDS-OM) platform.",
   "\"To further improve ease of access, a mobile application of the Retail Direct portal is being developed. The app will enable investors to buy and sell instruments on the go, at their convenience. The app will be available for use shortly,\" RBI Governor Shaktikanta Das said, while announcing the first bi-monthly monetary policy for the current fiscal.",
   "The government is planning for gross market borrowing of Rs 14.13 lakh crore for 2024-25. Out of this Rs 7.5 lakh crore, or 53 per cent, is scheduled to be borrowed in the first half (H1).",
   "In a separate announcement, RBI permitted non-bank payment system operators to offer Central Bank Digital Currency (CBDC) wallets to encourage its wider use.",
   "Currently, CBDC pilots in the retail and wholesale segments are underway with more use-cases and more participating banks.",
   "\"Continuing with this approach, it is proposed to make CBDC-Retail accessible to a broader segment of users in a sustained manner, by enabling non-bank payment system operators to offer CBDC wallets,\" he said.",
   "This is expected to enhance access and expand choices available to users apart from testing the resiliency of the CBDC platform to handle multi-channel transactions, he said, adding, necessary changes will be made to the system to facilitate this.",
   "In November 2022, the pilot of the wholesale CBDC, known as the Digital Rupee-Wholesale (e-W), was launched with the use case being limited to the settlement of secondary market transactions in government securities. In the following month, RBI rolled out a pilot in the retail version of the CBDC (e-R)."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2023-09\/13\/full\/1694590372-4784.jpg"
 },
 {
  "headlines":"RBI lowers quarter-wise inflation forecast for FY25, holds key rate steady",
  "content":[
   "The Reserve Bank of India's (RBI) Monetary Policy Committee (MPC) on Friday lowered its consumer price index (CPI) inflation forecast for the first, second, and the fourth quarter of Financial Year 2024-25 (FY25). Inflation in the second quarter is projected at 3.8 per cent, below the central bank's target of 4 per cent.",
   "The rate-setting panel, in its first meeting of the financial year, kept the repo rate unchanged at 6.5 per cent. Five out of six members voted in favour of the rate decision while the monetary policy stance of 'withdrawal of accommodation' was retained with a majority of five votes.",
   "The RBI projected the inflation in the first quarter (April-June) at 4.9 per cent, against its earlier forecast of 5 per cent. The fourth quarter (January-March) is estimated at 4.5 per cent, against the earlier 4.7 per cent forecast. The inflation forecast for FY25 remained unchanged at 4.5 per cent.",
   "“As we expected, the MPC policy took recognition of the fluidity of global narratives, even as domestic dynamics have stayed favourable. This suggests that when needed, the aim of financial stability may even precede inflation management,” said Madhavi Arora, lead economist at Emkay Global Financial Services.",
   "“We have long maintained that the RBI policy has been somewhat pegged to the Fed [US Federal Reserve], specifically over the last two years, even as it formally targeted inflation. This seems fair, as external dynamics have been fluid, implying that the policy prerogative needs to be flexible for ensuring financial stability. The fluidity of global narratives and policy repricing, in conjunction with the near-term problem-of-plenty on INR\/bonds, could make it arduous for the RBI to find a balance in its policy biases,” said Arora.",
   "“Thus, we maintain the RBI’s tone will slowly tiptoe to ‘Gracklish’ from the usual ‘Hawk-Dove’ signaling, implying a non-committal stance and limited definite forward guidance ahead,” she added.",
   "“Inflation was the elephant in the room. Now the elephant has left the room and it appears to be on its way to the forest. We would like the elephant to go to the forest and stay there,” said RBI governor Shaktikanta Das in this monetary policy statement.",
   "He noted that headline inflation has decreased since its peak in December. However, persistent food price pressures have been impeding the ongoing disinflation process, posing challenges for the final descent of inflation to the target."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2024-02\/27\/full\/1709019646-9951.jpg"
 },
 {
  "headlines":"RBI to permit investment, trading of Sovereign Green Bonds at Gujarat IFSC",
  "content":[
   "The Reserve Bank on Friday announced that it will allow investment and trading of Sovereign Green Bonds (SGrBs) at the International Financial Services Centre (IFSC), Gandhinagar.",
   "Based on an announcement in the Union Budget for 2022-23, the government issued Sovereign Green Bonds (SGrBs) in January 2023. Subsequently, SGrBs were issued as part of the government borrowing calendar in 2023-24.",
   "At present, foreign portfolio investors (FPIs) registered with SEBI are permitted to invest in SGrBs under the different routes available for investment by FPIs in government securities.",
   "\"With a view to facilitating wider non-resident participation in SGrBs, it has been decided to permit eligible foreign investors in the International Financial Services Centre (IFSC) to also invest in such bonds,\" RBI Governor Shaktikanta Das said, while announcing the first bi-monthly policy for FY'25.",
   "A scheme for investment and trading in SGrBs by eligible foreign investors in IFSC is being notified separately in consultation with the government and the IFSC Authority, he said.",
   "The government plans to borrow Rs 12,000 crore through issuance of Sovereign Green Bonds (SGrBs) in the first half of the current financial year.",
   "As part of the Budget estimate, the government is planning for gross market borrowing of Rs 14.13 trillion for 2024-25. Out of this, Rs 7.5 trillion, or 53 per cent, is scheduled to be borrowed in the first half.",
   "At present, GIFT IFSC is the maiden international financial services centre in India."
  ],
  "img_link":"https:\/\/bsmedia.business-standard.com\/_media\/bs\/img\/article\/2023-04\/06\/full\/1680742936-537.jpg"
 }
]